# PreviewControl Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PreviewControl Constructor
PreviewControl Class See Also
---
Constructs a preview control.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public PreviewControl(
	Document document,
	ElementId viewId
)
```

Visual Basic
---
```text
Public Sub New ( _
	document As Document, _
	viewId As ElementId _
)
```

Visual C++
---
```text
public:
PreviewControl(
	Document^ document,
	ElementId^ viewId
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..DocumentThe document.
viewId
    Type: Autodesk.Revit.DB..::..ElementIdThe view id want to browse in this control.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when dbDocument or viewId is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the given document is a linked document or the given viewId is invalid or the view is a schedule or other non-graphical view such as schedule views or the project browser view. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when there is an active preview control already. |

# See Also
PreviewControl Class
Autodesk.Revit.UI Namespace